<?php

// +----------------------------------------------------------------------
// | ThinkAdmin
// +----------------------------------------------------------------------
// | 版权所有 2014~2017 广州楚才信息科技有限公司 [ http://www.cuci.cc ]
// +----------------------------------------------------------------------
// | 官方网站: http://think.ctolog.com
// +----------------------------------------------------------------------
// | 开源协议 ( https://mit-license.org )
// +----------------------------------------------------------------------
// | github开源项目：https://github.com/zoujingli/ThinkAdmin
// +----------------------------------------------------------------------

namespace think;

// 加载基础文件
require __DIR__ . '/thinkphp/base.php';
// 定义应用目录
define('APP_PATH', __DIR__ . '/application/');

$path = str_replace('/index.php', '', str_replace('\\', '/', __FILE__));
define('ROOT_PATH_PRO',$path);//项目真实根路径
// 执行应用并响应
// 执行应用并响应2
Container::get('app', [__DIR__ . '/application/'])->run()->send();
